# 1.Реализовать скрипт, в котором должна быть предусмотрена функция расчёта заработной платы сотрудника.
# Используйте в нём формулу: (выработка в часах*ставка в час) + премия.
# Во время выполнения расчёта для конкретных значений необходимо запускать скрипт с параметрами.
def calc():
    x=float(input("Скoлько часов отработал в месяце струдник:"))
    y=float(input("Введите стоимость одного  часа:"))
    z=float(input("Введите сумму выделенную для премию за отработанный месяц:"))
    res=(x*y)
    return res+z
print("Заработная плата составит :",calc())

#2.Представлен список чисел.
# Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
str=[]
list =[int(i) for i in input("Введите список чисел:")]
for i in range(1, len(list)):
    if list[i] > list[i-1]:
        (str.append(list[i]))
print("Исходный список: ",list)
print("Список, элементы которого больше предыдущего: ", str)

# 3.Для чисел в пределах от 20 до 240 найти числа, кратные 20 или 21.
# Необходимо решить задание в одну строку.

list = [i for i in range(20, 240) if i % 20 == 0 or i % 21 == 0]

print("Список чисел кратных 20 или 21 в диапазоне [20..240): ", list)


# 4. Представлен список чисел. Определить элементы списка, не имеющие повторений.
# Сформировать итоговый массив чисел, соответствующих требованию.
# Элементы вывести в порядке их следования в исходном списке.
# Для выполнения задания обязательно использовать генератор.

list = [8, 9, 2, 4, 9, 1, 8, 1, 5, 2]
print("Исходные элементы списка:\n", list)
new_list = [i for i in list if list.count(i) == 1]
print("Элементы списка, не имеющие повторений:\n", new_list)


# 5. Реализовать формирование списка, используя функцию range() и возможности генератора.
# В список должны войти четные числа от 100 до 1000 (включая границы).
# Необходимо получить результат вычисления произведения всех элементов списка.

from functools import reduce

list = [i for i in range(1, 1001,2)]
print("Список чётных чисел в диапазоне [100..1000]:\n", list)
print("Произведение всех элементов списка:\n", reduce(lambda x,y: x*y, list))

# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.

from itertools import count

n = int(input("Введите целое число:"))

for i in count(n):
    print(i)

from itertools import cycle

list = [4, 9, 3, 1, 12, 4, 2, 1]
for i in cycle(list):
    print(i)

# 7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор. Функция должна вызываться следующим образом:
# for el in fact(n).
# Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые n чисел,
# начиная с 1! и до n!.


from math import factorial
print(factorial(5))
