#Создать список и заполнить его элементами различных типов данных.
#Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа.
#Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.
ls="Поздравляю тебя"
ls2=" с днем рождения"
print(ls+ls2)
li=[12,16,22,18]
print(li)
print(type(ls))
print(type(li))
print(ls.upper()+ls2.upper())
print(ls.title()+ls2.title())
print(len(ls)+len(ls2))
print( ls[::-1] + ls2[::-1])
li.insert(1,"Мишка")
print(li)
# Для списка реализовать обмен значений соседних элементов.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т. д.
# При нечётном количестве элементов последний сохранить на своём месте.

my_list = input("Введите элементы списка: ").split() # строка разбивается на отдельные элементы
for i in range(0, len(my_list)-1,2): #диапазон значения для переменной i от 0 до конечного элемента заданного списка с шагом 2
    my_list[i], my_list[i+1] = my_list[i+1], my_list[i]  #формула для обмена элементами с списке
print(my_list)

#3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить, к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и dict.
list = ['winter', 'spring', 'summer', 'autumn'] # создание списков
dict = {1 : 'winter', 2 : 'spring', 3 : 'summer', 4 : 'autumn'} #создание словаря с  ключями
month = int(input("Введите месяц по номеру "))
if month ==12 or month == 1 or month == 2: #условие для зимних месяцев,ключ соответствия 1
        print(dict.get(1)) # ключ 1
        print(list[0])# в списке ключу 1 соответствует 0 ичейка спска это winter
elif month == 3 or month == 4 or month ==5: #продолжение условия,как бы далее для ключа 2
    print(dict.get(2)) # ключ 2
    print(list[1])# в списке  к ключу 2 соответствует ичейка 1 sprint
elif month == 6 or month == 7 or month == 8:
    print(dict.get(3))
    print(list[2])

elif month == 9 or month == 10 or month == 11:
    print(dict.get(4))
    print(list[3])
else:# а также,при введени числа не входящего в диапазон от 1 до 12,выдать ошибку
        print("Такого месяца не существует")
#Пользователь вводит строку из нескольких слов, разделённых пробелами.
#Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
#Если в слово длинное, выводить только первые 10 букв в слове.

list = input("введите предложение ")
word = [] #создание списка какого-то
number = 1
for element in range(list.count(' ') + 1):
    word = list.split()
    if len(str(word)) <= 10:
        print(f" {number} {word [element]}")
        number += 1
    else:
        print(f" {number} {word [element] [0:10]}")
        number += 1
#Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
#У пользователя необходимо запрашивать новый элемент рейтинга.
# Если в рейтинге существуют элементы с одинаковыми значениями,то новый элемент с тем же
# значением должен разместиться послених.

my_list = [5, 4, 3, 2, 1]
print(f"Рейтинг - {my_list}")
digit = int(input("Введите число (000 - выход) "))
while digit != 000:
    for el in range(len(my_list)):
        if my_list[el] == digit:
            my_list.insert(el + 1, digit)
            break
        elif my_list[0] < digit:
            my_list.insert(0, digit)
        elif my_list[-1] > digit:
            my_list.append(digit)
        elif my_list[el] > digit and my_list[el + 1] < digit:
            my_list.insert(el + 1, digit)
    print(f"текущий список - {my_list}")
    digit = int(input("Введите число (000 - выход) "))



