#Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
#Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
def delit():
    a=(float(input ("Введите первое число:\n")))
    b=(float(input("Введите второе число:\n")))
    if b == 0:
        print("На 0 делить нельзя!")
    else:
        print(a/b)


 delit()
#Выполнить функцию, которая принимает несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Осуществить вывод данных о пользователе одной строкой.
def fio():
    a = (input("Введите имя:\n"))
    b=(input("Введите фамилию:\n"))
    r = (input("Введите год рождения:\n"))
    d = (input("Введите адрес постоянного проживания:\n"))
    e = (input("Введите номер телефона:\n"))
    f = (input("Введите ваш email:\n"))
    res=a+b+r+d+e+f
    print(res.split())
fio()

#Реализовать функцию my_func(), которая принимает три позиционных аргумента
# и возвращает сумму наибольших двух аргументов
def my_func ():
   a=int(input("Введи число а:"))
   b =int(input("Введи число b:"))
   c =int(input("Введи число c:"))
   if a or b > c:
      return a and b
   res=a+b
   print(res)
   my_func()

#Программа принимает действительное положительное число x и целое отрицательное число y.
# Выполните возведение числа x в степень y. Задание реализуйте в виде функции my_func(x, y).
# При решении задания нужно обойтись без встроенной функции возведения числа в степень.
x=int(input("Введите абсолютное число:"))
y=int(input("Возведите введеное число в степень:"))
def my_func (x,y):
    res=x**y
    return (res)


print(my_func(x,y))


# не понимаю как выполнить 5 и 6 задачи