#Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
#Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
# def delit(a,b):
#     c=a/b
#     return c
# print(delit(int(input("Введите первое число:")),int(input("Введите второе число:"))))

#Выполнить функцию, которая принимает несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Осуществить вывод данных о пользователе одной строкой.
# def fio(a,b,c,d,e,f):
#    return(a,b,c,d,e,f)
#
# a = (input("Введите имя:"))
# b=  (input("Введите фамилию:"))
# c = (input("Введите год рождения:"))
# d = (input("Введите адрес постоянного проживания:"))
# e = (input("Введите номер телефона:"))
# f = (input("Введите ваш email:"))
# print (fio(a,b,c,d,e,f))

#Реализовать функцию my_func(), которая принимает три позиционных аргумента
# и возвращает сумму наибольших двух аргументов
# def my_func (a,b,c):
#    print("Сумма наибольших аргументов:" , {a + b + c - min([a, b, c])})
#
# my_func(
#    int(input("Введи число а:")),
#    int(input("Введи число b:")),
#    int(input("Введи число c:")))

#Программа принимает действительное положительное число x и целое отрицательное число y.
# Выполните возведение числа x в степень y. Задание реализуйте в виде функции my_func(x, y).
# При решении задания нужно обойтись без встроенной функции возведения числа в степень.



